---
title: "Week 3"
format:
    html:
        toc: true
        toc_depth: 2
        number_sections: true
        smooth-scroll: true
        code-fold: true
    revealjs:
        smaller: true
        center: false
        scrollable: true
        slideNumber: true
        code-line-numbers: false
        footer: '<a href="w3.ipynb">Complete notes</a>'
        output-file: w3-revealjs.html
execute:
    echo: false
---

In [ ]:
!pip3 install ipython-sql

In [1]:
%load_ext sql

In [33]:
%reload_ext sql

# Lecture 3.1: SQL Examples

In [2]:
%sql sqlite:///univdata.db

## Select distinct

- From the `classroom` relation, find the names of buildings in which every individual classroom has capacity less than 100 (removing the duplicates).

In [ ]:
classroom = %sql SELECT * FROM classroom;

In [4]:
classroom

[('Packard', '101', 500),
 ('Painter', '514', 10),
 ('Taylor', '3128', 70),
 ('Watson', '100', 30),
 ('Watson', '120', 50)]

Query:

```sql
SELECT DISTINCT building
FROM classroom
WHERE capacity < 100;
```

In [ ]:
result1 = %sql SELECT DISTINCT building FROM classroom C WHERE capacity < 100;

In [12]:
result1

[('Painter',), ('Taylor',), ('Watson',)]

## Select all

- From the `classroom` relation, find the names of buildings in which every individual classroom has a capacity of less than 100 (without removing the duplicates).

In [20]:
classroom

[('Packard', '101', 500),
 ('Painter', '514', 10),
 ('Taylor', '3128', 70),
 ('Watson', '100', 30),
 ('Watson', '120', 50)]

Query:

```sql
SELECT ALL building
FROM classroom C
WHERE capacity < 100;
```

In [ ]:
result3 = %sql SELECT ALL building FROM classroom C WHERE capacity < 100;

In [16]:
result3

[('Painter',), ('Taylor',), ('Watson',), ('Watson',)]

- Note that duplicate retention is the default and hence it is a common practice to skip `all` immediately after `select`.

## Cartesian product

In [ ]:
department = %sql SELECT * FROM department

In [8]:
department

[('Biology', 'Watson', 90000),
 ('Comp. Sci.', 'Taylor', 100000),
 ('Elec. Eng.', 'Taylor', 85000),
 ('Finance', 'Painter', 120000),
 ('History', 'Painter', 50000),
 ('Music', 'Packard', 80000),
 ('Physics', 'Watson', 70000)]

In [ ]:
student = %sql SELECT * FROM student;

In [10]:
student

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

- Find the list of all students of departments which have a budget < $0.1million

In [ ]:
c_product = %sql SELECT name, budget FROM student, department WHERE student.dept_name = department.dept_name AND budget < 100000;

```sql
SELECT name, budget
FROM student, department
WHERE student.dept_name = department.dept_name AND budget < 100000;
```

In [12]:
c_product

[('Brandt', 50000),
 ('Peltier', 70000),
 ('Levy', 70000),
 ('Sanchez', 80000),
 ('Snow', 70000),
 ('Aoi', 85000),
 ('Bourikas', 85000),
 ('Tanaka', 90000)]

- The above query first generates every possible student-department pair, which is the Cartesian product of the `student` and `department` relations. Then, it filters out all the rows with student.dept_name = department.dept_name **and** department.budget < 100000.
- The common attribute `dept_name` in the resulting table is renamed using the relation name - student.dept_name and department.dept_name.

## Rename AS Operation

- The same query above can be framed by renaming the tables as follows:

In [ ]:
rename = %sql SELECT S.name AS studentname, budget AS deptbudget FROM student AS S, department AS D WHERE S.dept_name = D.dept_name AND budget < 100000;

```sql
SELECT S.name AS studentname, budget AS deptbudget
FROM student AS S, department AS D
WHERE S.dept_name = D.dept_name AND budget < 100000;
```

In [14]:
rename

[('Brandt', 50000),
 ('Peltier', 70000),
 ('Levy', 70000),
 ('Sanchez', 80000),
 ('Snow', 70000),
 ('Aoi', 85000),
 ('Bourikas', 85000),
 ('Tanaka', 90000)]

- The above query renames the relations `student` and `department` as `S` and `D` respectively
- It also displays the attribute `name` as `StudentName` and `budget` as `DeptBudget`
- Note that the budget attribute does not have any prefix because it occurs only in the department relation.

## Where: AND and OR

- From the `instructor` and `department` relations, find out the names of all instructors whose department is Finance *or* whose department is in any of the following buildings: Watson, Taylor.

In [ ]:
instructor = %sql SELECT * FROM instructor;

In [16]:
instructor

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

In [17]:
department

[('Biology', 'Watson', 90000),
 ('Comp. Sci.', 'Taylor', 100000),
 ('Elec. Eng.', 'Taylor', 85000),
 ('Finance', 'Painter', 120000),
 ('History', 'Painter', 50000),
 ('Music', 'Packard', 80000),
 ('Physics', 'Watson', 70000)]

```sql
SELECT name
FROM instructor I, department D
WHERE I.dept_name = D.dept_name
AND (I.dept_name = 'Finance' OR building IN ('Watson', 'Taylor'));
```

In [ ]:
result4 = %sql SELECT name FROM instructor I, department D WHERE I.dept_name = D.dept_name AND (I.dept_name = 'Finance' OR building IN ('Watson', 'Taylor'));

In [19]:
result4

[('Srinivasan',),
 ('Wu',),
 ('Einstein',),
 ('Gold',),
 ('Katz',),
 ('Singh',),
 ('Crick',),
 ('Brandt',),
 ('Kim',)]

## String Operations

In [ ]:
course = %sql SELECT * FROM course;

In [22]:
course

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

- From the course `relation`, find the titles of all courses whose `course_id` has three alphabets indicating the department.

In [ ]:
result5 = %sql SELECT title FROM course WHERE course_id LIKE '___-%';

```sql
SELECT title
FROM course
WHERE course_id LIKE '___-%';
```

In [27]:
result5

[('Intro. to Biology',),
 ('Genetics',),
 ('Computational Biology',),
 ('Investment Banking',),
 ('World History',),
 ('Physical Principles',)]

- The `course_id` of each department either has 2 or 3 alphabets in the beginning, followed by a hypher and then followed by 3 digits. The above query returns the names of all courses whose `course_id` has 3 alphabets in the beginning.

## Order By

In [23]:
student

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

- From the student relation in the table, obtain the list of all students in alphabetic order of departments and within each department, in decreasing order of total credits.

In [ ]:
result6 = %sql SELECT name, dept_name, tot_cred FROM student ORDER BY dept_name ASC, tot_cred DESC;

```sql
SELECT name, dept_name, tot_cred
FROM student
ORDER BY dept_name ASC, tot_cred DESC;
```

In [29]:
result6

[('Tanaka', 'Biology', 120),
 ('Zhang', 'Comp. Sci.', 102),
 ('Brown', 'Comp. Sci.', 58),
 ('Williams', 'Comp. Sci.', 54),
 ('Shankar', 'Comp. Sci.', 32),
 ('Bourikas', 'Elec. Eng.', 98),
 ('Aoi', 'Elec. Eng.', 60),
 ('Chavez', 'Finance', 110),
 ('Brandt', 'History', 80),
 ('Sanchez', 'Music', 38),
 ('Peltier', 'Physics', 56),
 ('Levy', 'Physics', 46),
 ('Snow', 'Physics', 0)]

- The list is first sorted in alphabetic order of dept name.
- Within each dept, it is sorted in decreasing order of total credits.

## In Operator

In [ ]:
teaches = %sql SELECT * FROM teaches;

In [25]:
teaches

[('10101', 'CS-101', '1', 'Fall', 2017),
 ('10101', 'CS-315', '1', 'Spring', 2018),
 ('10101', 'CS-347', '1', 'Fall', 2017),
 ('12121', 'FIN-201', '1', 'Spring', 2018),
 ('15151', 'MU-199', '1', 'Spring', 2018),
 ('22222', 'PHY-101', '1', 'Fall', 2017),
 ('32343', 'HIS-351', '1', 'Spring', 2018),
 ('45565', 'CS-101', '1', 'Spring', 2018),
 ('45565', 'CS-319', '1', 'Spring', 2018),
 ('76766', 'BIO-101', '1', 'Summer', 2017),
 ('76766', 'BIO-301', '1', 'Summer', 2018),
 ('83821', 'CS-190', '1', 'Spring', 2017),
 ('83821', 'CS-190', '2', 'Spring', 2017),
 ('83821', 'CS-319', '2', 'Spring', 2018),
 ('98345', 'EE-181', '1', 'Spring', 2017)]

- From the `teaches` relation, find the IDs of all courses taught in the Fall or Spring of 2018.

In [ ]:
result7 = %sql SELECT course_id FROM teaches WHERE semester IN ('Fall', 'Spring') AND year = 2018;

```sql
SELECT course_id
FROM teaches
WHERE semester IN ('Fall', 'Spring') AND year = 2018;
```

In [31]:
result7

[('CS-315',),
 ('FIN-201',),
 ('MU-199',),
 ('HIS-351',),
 ('CS-101',),
 ('CS-319',),
 ('CS-319',)]

- Note: We can use `distinct` to remove duplicates.

In [ ]:
result8 = %sql SELECT DISTINCT course_id FROM teaches WHERE semester IN ('Fall', 'Spring') AND year = 2018;

```sql
    SELECT DISTINCT course_id
    FROM teaches
    WHERE semester IN ('Fall', 'Spring') AND year = 2018;
```

In [33]:
result8

[('CS-315',),
 ('FIN-201',),
 ('MU-199',),
 ('HIS-351',),
 ('CS-101',),
 ('CS-319',)]

# Set Operations: union

- For the same question as above, find the solution using the `union` operator.

```sql
SELECT course_id
from teaches
WHERE semester='Fall' AND year=2018
UNION
SELECT course_id
from teaches
WHERE semester='Spring' AND year=2018;
```

In [ ]:
result9 = %sql SELECT course_id from teaches WHERE semester='Fall' AND year=2018 UNION SELECT course_id from teaches WHERE semester='Spring' AND year=2018

In [35]:
result9

[('CS-101',),
 ('CS-315',),
 ('CS-319',),
 ('FIN-201',),
 ('HIS-351',),
 ('MU-199',)]

- Note that `union` removes all duplicates. If we use `union all` instead of `union`, we get the same set of tuples but with duplicates.

## Set Operations (2): intersect

In [36]:
instructor

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

- From the `instructor` relation, find the names of all instructors who taught in either the Computer Science department or the Finance department and whose salary is < 80000.

```sql
    SELECT name
    FROM instructor
    WHERE dept_name IN ('Comp. Sci.', 'Finance')
    INTERSECT
    SELECT name
    FROM instructor
    WHERE salary < 80000;
```

In [ ]:
result10 = %sql SELECT name FROM instructor WHERE dept_name IN ('Comp. Sci.', 'Finance') INTERSECT SELECT name FROM instructor WHERE salary < 80000;

In [38]:
result10

[('Katz',), ('Srinivasan',)]

```sql
SELECT name
FROM instructor
WHERE dept_name IN ('Comp. Sci.', 'Finance') AND salary < 80000;
```

In [ ]:
result11 = %sql SELECT name FROM instructor WHERE dept_name IN ('Comp. Sci.', 'Finance') AND salary < 80000;

In [40]:
result11

[('Srinivasan',), ('Katz',)]

## Set Operations (3): except

- From the `instructor` relation, find the names of all instructors who taught in the Computer Science department or the Finance department and whose salary is either >= 90000 or <= 70000.

```sql
    SELECT name
    FROM instructor
    WHERE dept_name IN ('Comp. Sci.', 'Finance')
    EXCEPT
    SELECT name
    FROM instructor
    WHERE salary < 90000 AND salary > 70000;
```

In [ ]:
result12 = %sql SELECT name FROM instructor WHERE dept_name IN ('Comp. Sci.', 'Finance') EXCEPT SELECT name FROM instructor WHERE salary < 90000 AND salary > 70000;

In [42]:
result12

[('Brandt',), ('Srinivasan',), ('Wu',)]

```sql
SELECT name
FROM instructor
WHERE dept_name IN ('Comp. Sci.', 'Finance') AND (salary >= 90000 OR salary <= 70000);
```

In [ ]:
result13 = %sql SELECT name FROM instructor WHERE dept_name IN ('Comp. Sci.', 'Finance') AND (salary >= 90000 OR salary <= 70000);

In [44]:
result13

[('Srinivasan',), ('Wu',), ('Brandt',)]

## Aggregate functions: avg

In [45]:
classroom

[('Packard', '101', 500),
 ('Painter', '514', 10),
 ('Taylor', '3128', 70),
 ('Watson', '100', 30),
 ('Watson', '120', 50)]

- From the `classroom` relation, find the names and the average capacity of each building whose average capacity is greater than 25.

```sql
    SELECT building, AVG(capacity)
    FROM classroom
    GROUP BY building
    HAVING AVG(capacity) > 25;
```

In [ ]:
result14 = %sql SELECT building, AVG(capacity) FROM classroom GROUP BY building HAVING AVG(capacity) > 25;

In [49]:
result14

[('Packard', 500.0), ('Taylor', 70.0), ('Watson', 40.0)]

## Aggregate functions (2): min

In [46]:
instructor

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('12121', 'Wu', 'Finance', 90000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76543', 'Singh', 'Finance', 80000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

- From the `instructor` relation, find the least salary drawn by any instructor among all the instructors.

```sql
SELECT MIN(salary) AS least_salary
FROM instructor;
```

In [ ]:
result15 = %sql SELECT MIN(salary) AS least_salary FROM instructor;

In [51]:
result15

[(40000,)]

## Aggregate functions (3): max

In [47]:
student

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

- From the `student` relation, find the maximum credits obtained by any student among all the students.

```sql
SELECT MAX(tot_cred) AS max_credits
FROM student;
```

In [ ]:
result16 = %sql SELECT MAX(tot_cred) AS max_credits FROM student;

In [53]:
result16

[(120,)]

## Aggregate functions (4): count

In [ ]:
section = %sql SELECT * FROM section;

In [55]:
section

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', 2018, 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', 2017, 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', 2017, 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', 2017, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A')]

- From the `section` relation, find the number of courses run in each building.

```sql
SELECT building, COUNT(course_id) AS course_count
FROM section
GROUP BY building;
```

In [ ]:
result17 = %sql SELECT building, COUNT(course_id) AS course_count FROM section GROUP BY building;

In [58]:
result17

[('Packard', 4), ('Painter', 3), ('Taylor', 5), ('Watson', 3)]

## Aggregate functions (5): sum

In [56]:
course

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

- From the `course` relation, find the total credits offered by each department.

```sql
SELECT dept_name, SUM(credits) AS sum_credits
FROM course
GROUP BY dept_name;
```

In [ ]:
result18 = %sql SELECT dept_name, SUM(credits) AS sum_credits FROM course GROUP BY dept_name;

In [60]:
result18

[('Biology', 11),
 ('Comp. Sci.', 17),
 ('Elec. Eng.', 3),
 ('Finance', 3),
 ('History', 3),
 ('Music', 3),
 ('Physics', 4)]

# Lecture 3.2: Intermediate SQL/1

## Nested Subqueries

- SQL provides a mechanism for nesting of subqueries
- A **subquery** is a **select-from-where** expression that is nested within another query
- The nesting can be done in the following SQL query
  $$ \text{select } A_1, A_2, ..., A_n $$
    $$ \text{from } r_1, r_2, ..., r_m $$
    $$ \text{where } P $$
  as follows:
   - $A_i$ can be a subquery that generates a single value
   - $r_i$ can be replaced by any valid subquery
   - $P$ can be replaced with an expressionm of the form:
    
      $B \text{ <operation>}$ (subquery)
    
      where $B$ is an attribute and $\text{<operation>}$ to be defined later.

## Subqueries in the Where Clause

- Typical use of subqueries is to perform tests:
  - For set membership
  - For set comparisons
  - For set cardinality

## Set Membership
- Find courses offered in Fall 2009 and in Spring 2010 (**intersect** example)
```sql
    select distinct course_id
    from section
    where semester = 'Fall' and year = 2017 and
    course_id in (select course_id
                from section
                where semester = 'Spring' and year = 2018);
```

In [ ]:
result19 = %sql select distinct course_id from section where semester = 'Fall' and year = 2017 and course_id not in (select course_id from section where semester = 'Spring' and year = 2018);

In [62]:
result19

[('CS-347',), ('PHY-101',)]

## Set Membership (2)

- Find the total number of (distinct) students who have taken course sections taught by instructor with ID '10101'
```sql
select count(distinct ID)
from takes
where (course_id, sec_id, semester, year) in
    (select course_id, sec_id, semester, year
    from teaches
    where teaches.ID = '10101');
```

In [ ]:
result20 = %sql select count(distinct ID) from takes where (course_id, sec_id, semester, year) in (select course_id, sec_id, semester, year from teaches where teaches.ID = '10101');

In [64]:
result20

[(6,)]

In [29]:
result

[(6,)]

## Set Comparison - "some" Clause

- Find the names of instructors with salary greater than that of some (at least one) instructor in the Biology department

```sql
    select distinct T.name
    from instructor T, instructor S
    where T.salary > S.salary and S.dept_name = 'Biology';
```

- Same query using **some** clause
```sql
    select name
    from instructor
    where salary > some (select salary
                        from instructor
                        where dept_name = 'Biology');
```

## Definition of "some" Clause

- F $\text{<comp>}$ **some** $r \Leftrightarrow \exists t \in r$ such that (F $\text{<comp>}$ t)
    where $\text{<comp>}$ can be: $<$, $\leq$, $>$, $\geq$, $=$, $\neq$
- **some** represents existential quantification

(5 < **some** {0, 5, 6}) = True

(5 < **some** {0, 5}) = False

(5 = **some** {0, 5}) = True

(5 $\neq$ **some** {0, 5}) = False

(= **some**) $\equiv$ **in**

However, ($\neq$ **some**) $\equiv$ **not in**

## Set Comparison - "all" Clause

- Find the names of all instructors with salary greater than that of all instructors in the Biology department
```sql
select name
from instructor
where salary > all (select salary
                    from instructor
                    where dept_name = 'Biology');
```

## Definition of "all" Clause

- F $\text{<comp>}$ **all** $r \Leftrightarrow \forall t \in r$ such that (F $\text{<comp>}$ t)
    where $\text{<comp>}$ can be: $<$, $\leq$, $>$, $\geq$, $=$, $\neq$
- **all** represents universal quantification

(5 < **all** {0, 5, 6}) = False

(5 < **all** {6, 10}) = True

(5 = **all** {0, 5}) = False

(5 $\neq$ **all** {4, 6}) = True

($\neq$ **all**) $\equiv$ **not in**

However, ($=$ **all**) !$\equiv$ **in**

## Test for Empty Relations: "exists"

- The **exists** constucrt returns the value **true** if the argument subquery is non-empty
  - **exists** $r \Leftrightarrow r \neq \emptyset $
  - **not exists** $r \Leftrightarrow r = \emptyset $

## Use of "exists" clause

- Yet another way of specifying the query “Find all courses taught in both the Fall 2009
semester and in the Spring 2010 semester”
```sql
select course_id
from section as S
where semester = 'Fall' and year = 2009 and
exists (select *
        from section as T
        where semester = 'Spring' and year = 2010 and
        S.course_id = T.course_id);
```
- **Correlation name** - variable S in the outer query
- **Correlated subquery** - subquery that references the correlation name (the inner query)

## Use of "not exists" clause

- Find all students who have taken all courses offered in the Biology department.
```sql
select distinct S.ID, S.name
from student as S
where not exists ((select course_id
                    from course
                    where dept_name = 'Biology')
                    except
                    (select T.course_id
                    from takes as T
                    where S.ID = T.ID));
```
  - First nested query lists all courses offered in Biology
  - Second nested query lists all courses a particular student took

- Note: $X-Y = \emptyset \Leftrightarrow X \subseteq Y$
- Note: Cannot write this query using $=$ **all** and its variants

## Test for Absence of Duplicate Tuples: "unique"

- The **unique** construct tests whether a subquery has any duplicate tuples in its result
- The **unique** construct evaluates to **true** if the subquery result has no duplicate tuples
- Find all courses that were offered at most once in 2009
```sql
select T.course_id
from course as T
where unique (select R.course_id
              from section as R
              where R.course_id = T.course_id
              and R.year = 2009);
```

## Subqueries in the From Clause

- SQL allows a subquery expression to be used in the **from** clause
- Find the average instructors’ salaries of those departments where the average salary is greater than $42,000

```sql
select dept_name, avg_salary
from (select dept_name, avg(salary) as avg_salary
      from instructor
      group by dept_name)
where avg_salary > 42000;
```
- Note that we do not need to use the **having** clause
- Another way to write the same query is:
```sql
select dept_name, avg_salary
from (select dept_name, avg(salary)
      from instructor
      group by dept_name) as dept_avg (dept_name, avg_salary)
where avg_salary > 42000;
```

## With Clause

- The **with** clause provides a way of defining a temporary relation whose definition is available only to the query in which the with clause occurs
- Find all departments with the maximum budget

```sql
with max_budget(value) as
    (select max(budget)
    from department)
select department.dept_name
from department, max_budget
where department.budget = max_budget.value;
```

## Complex Queries using With Clause

- Find all departments where the total salary is greater than the average of the total salary at all departments

```sql
with dept_total(dept_name, value) as
    select dept_name, sum(salary)
    from instructor
    group by dept_name,
dept_total_avg(value) as
    (select avg(value)
    from dept_total)
select dept_name
from dept_total, dept_total_avg
where dept_total.value > dept_total_avg.value;
```

## Scalar Subquery

- A **scalar subquery** is a subquery that returns a single value
- List all departments along with the number of instructors in each department

```sql
select dept_name,
    (select count(*)
    from instructor
    where instructor.dept_name = department.dept_name)
    as num_instructors
    from department;
```
- Runtime error if the subquery returns more than one result tuple

## Modification of the Database

- Deletion of tuples from a given relation
- Insertion of new tuples into a given relation
- Updating of values in some tuples in a given relation

## Deletion

- Delete all instructors

    ```sql
    delete from instructor;
    ```

- Delete all instructors from the Finance department

    ```sql
    delete from instructor
    where dept_name = 'Finance';
    ```

- Delete all tuples in the instructor relation for those instructors associated with a department located in the Watson building

    ```sql
    delete from instructor
    where dept_name in (select dept_name
                        from department
                        where building = 'Watson');
    ```

- Delete all instructors whose salary is less than the average of all instructors’ salaries

    ```sql
    delete from instructor
    where salary < (select avg(salary)
                    from instructor);
    ```

- **Problem**: as we delete tuples, the average salary changes
- **Solution** used in SQL:
  - First compute **avg**(salary) and find all tuples to be deleted
  - Next, delete all tuples found above (without recomputing **avg** or retesting the tuples)

## Insertion

- Add a new typle to course

    ```sql
    insert into course
    values ('CS-437', 'Database Systems', 'Comp. Sci.', 4);
    ```

- or equivalently

    ```sql
    insert into course (course_id, title, dept_name, credits)
    values ('CS-437', 'Database Systems', 'Comp. Sci.', 4);
    ```

- Add a new tuple to student with tot_creds set to null

    ```sql
    insert into student
    values ('3003', 'Green', 'Finance', null);
    ```

- Add all instructors to the student relation with tot_creds set to 0

    ```sql
    insert into student
    select ID, name, dept_name, 0
    from instructor;
    ```

- The **select-from-where** statement is evaluated fully before any of its results are inserted into the relation
- Otherwise queries like

    ```sql
    insert into table1 select * from table1;
    ```

  would result in an infinite loop

## Updates

- Increase the salary of all instructors whose salary is over $100,00 by 3% and all others by 5%
    - With two **update** statements
  
        ```sql
        update instructor
            set salary = salary * 1.03
            where salary > 100000;
        update instructor
            set salary = salary * 1.05
            where salary <= 100000;
        ```

- The order is important
- Can be done better using the **case** statement

## Case Statement for Conditional Updates

- Same query as above using the **case** statement

    ```sql
    update instructor
        set salary = case
                    when salary <= 100000
                    then salary * 1.05
                    else salary * 1.03
                    end;
    ```

## Updates with Scalar Subqueries

- Recompute and update tot_creds value for all students
    
    ```sql
    update student
    set tot_creds = (select sum(credits)
                    from takes, course
                    where takes.course_id = course.course_id and
                    S.ID = takes.ID and
                    takes.grade <> 'F' and
                    takes.grade is not null);
    ```

- Set tot_creds to null for all students who have not taken any courses
- Instead of **sum**(credits), use:
    
    ```sql
        case
        when sum(credits) is not null then sum(credits)
        else 0
    end;
    ```

# Lecture 3.3: Intermediate SQL/2

## Join Relations

- **Join operations** take two relations and return as result another relation
- A join operation is a Cartesian product which requires that tuples in the two relations match (under some condition)
- It also specifies the attributes that are present in the result of the join
- The join operations are typically used as subquery expressions in the **from** clause

## Types of Joins between Relations
- Cross join
- Inner join
  - Equi-join
    - Natural join
- Outer join
  - Left outer join
  - Right outer join
  - Full outer join
- Self-join

## Cross Join

- CROSS JOIN returns the Cartesian product of rows from tables in the join
  - Explicit
    ```sql
    select *
    from employee cross join department;
    ```
  - Implicit
    ```sql
    select *
    from employee, department;
    ```

## Join Operations - Example

- Relation course

In [ ]:
course = %sql select * from course_3_3;

In [31]:
course

[('BIO-301', 'Genetics', 'Biology', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3)]

In [ ]:
prereq = %sql select * from prereq_3_3;

- Relation prereq

In [35]:
prereq

[('BIO-301', 'BIO-101'), ('CS-190', 'CS-101'), ('CS-347', 'CS-101')]

- Observe that
  - prereq information is missing for course CS-315, and
  - course information is missing for CS-347

## Inner Join

- course **inner join** prereq

In [ ]:
inner_join = %sql select * from course_3_3 INNER JOIN prereq_3_3 on prereq_3_3.course_id = course_3_3.course_id;

In [41]:
inner_join

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101')]

- If specified as **natural**, the join is on all attributes with the same name

In [ ]:
natural_join = %sql select * from course_3_3 NATURAL JOIN prereq_3_3;

In [43]:
natural_join

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101')]

## Outer Join

- An extension of the join operation that avoids loss of information
- Computes the join and then adds tuples from one relation that does not match tuples in the other relation to the result of the join
- Uses *null* values, which is None in Python

## Left Outer Join

- course **left outer join** prereq

In [ ]:
loj = %sql select * from course_3_3 LEFT OUTER JOIN prereq_3_3 on prereq_3_3.course_id = course_3_3.course_id;

In [45]:
loj

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, None, None)]

## Right Outer Join

- course **right outer join** prereq

In [ ]:
roj = %sql select * from course_3_3 RIGHT OUTER JOIN prereq_3_3 on prereq_3_3.course_id = course_3_3.course_id;

In [47]:
roj

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101'),
 (None, None, None, None, 'CS-347', 'CS-101')]

## Joined Relations

- Join operations take two relations and return as a result another relation

- These additional operations are typically used as subquery expressions in the **from** clause

- *Join condition* – defines which tuples in the two relations match, and what attributes are present in the result of the join
  ```sql
    natural
    on <predicate>
    using (attr1, attr2, ...)
  ```

- *Join type* – defines how tuples in each relation that do not match any tuple in the other
relation (based on the join condition) are treated
  ```sql
    inner join
    left outer join
    right outer join
    full outer join
  ```

## Full Outer Join

- course **full outer join** prereq

In [ ]:
foj = %sql select * from course_3_3 FULL OUTER JOIN prereq_3_3 on prereq_3_3.course_id = course_3_3.course_id;

In [49]:
foj

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, None, None),
 (None, None, None, None, 'CS-347', 'CS-101')]

## Joining Relations - Examples

- course **inner join** prereq **on**
  
  course.course_id = prereq.course_id

In [ ]:
ij = %sql select * from course_3_3 INNER JOIN prereq_3_3 on prereq_3_3.course_id = course_3_3.course_id;

In [51]:
ij

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101')]

- What is the difference between the above (equi-join) and the natural join?

- course **left outer join** prereq **on**
  
  course.course_id = prereq.course_id

In [52]:
loj

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, None, None)]

- course **natural right outer join** prereq

In [ ]:
nroj = %sql select * from course_3_3 NATURAL RIGHT OUTER JOIN prereq_3_3;

In [54]:
nroj

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-347', None, None, None, 'CS-101')]

- course **full outer join** prereq **using** (course_id)

In [ ]:
foj2 = %sql select * from course_3_3 NATURAL FULL OUTER JOIN prereq_3_3;

In [63]:
foj2

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, None),
 ('CS-347', None, None, None, 'CS-101')]

## Views

- In some cases, it is not desirable for all users to see the entire logical model (that is, all the actual relations stored in the database.)

- Consider a person who needs to know an instructors name and department, but not the salary. This person should see a relation described, in SQL, by:

  ```sql
  select ID, name, dept_name
  from instructor;
  ```

- A **view** provides a mechanism to hide certain data from the view of certain users

- Any relation that is not of the conceptual model but is made visible to a user as a "virtual relation" is called a **view**.

##  View Definition

- A view is defined using the create view statement which has the form

      create view v as < query expression >
  where < query expression > is any legal SQL expression

- The view name is represented by v

- Once a view is defined, the view name can be used to refer to the virtual relation that the view generates

- View definition is not the same as creating a new relation by evaluating the query expression

  - Rather, a view definition causes the saving of an expression; the expression is substituted into queries using the view

## Example Views

- A view of instructors without their salary 

    ```sql
    create view faculty as
    select ID, name, dept_name
    from instructor;
    ```

- A view of all instructors in the Biology department

    ```sql
    select name
        from faculty
        where dept_name = 'Biology';
    ```

- Create a view of department salary totals

    ```sql
    create view departments_total_salary(dept_name, total_salary) as
        select dept_name, sum(salary)
        from instructor
        group by dept_name;
    ```

## Views Defined Using Other Views

```sql
    create view physics_fall_2009 as
        select course.course_id, sec_id, building, room_number
        from course, section
        where course.course_id = section.course_id
            and course.dept_name = 'Physics'
            and section.semester = 'Fall'
            and section.year = 2009;
```


```sql
    create view physics_fall_2009_watson as
        select course_id, room_number
        from physics_fall_2009
        where building = 'Watson';
```

## View Expansion

- Expand use of a view in a query/another view

```sql
    create view physics_fall_2009_watson as
        (select course_id, room_number
        from (select course.course_id, building, room_number
            from course, section
            where course.course_id = section.course_id
                and course.dept_name = 'Physics'
                and section.semester = 'Fall'
                and section.year = 2009)
        where building = 'Watson');
```

-   One view may be used in the expression defining another view

-   A view relation $v_1$ is said to [*depend directly*]{.underline} on a view relation $v_2$ if $v_2$ is used in the expression defining $v_1$

-   A view relation $v_1$ is said to [*depend on*]{.underline} view relation $v_2$ if either $v_1$ depends directly on $v_2$ or there is a path of dependencies from $v_1$ to $v_2$

-   A view relation v is said to be [*recursive*]{.underline} if it depends on itself

- A way to define the meaning of views defined in terms of other views

- Let view $v_1$ be defined by an expression $e_1$ that may itself contain uses of view relations

- View expansion of an expression repeats the following replacement step:
  
    **repeat**

    - Find any view relation $v_i$ in $e_1$
    - Replace the view relation $v_i$ by the expression defining $v_i$ 
                 
    **until** no more view relations are present in $e_1$

- As long as the view definitions are not recursive, this loop will terminate

## Update of a View

- Add a new tuple to *faculty* view which we defined earlier
  ```sql
      insert into faculty values (’30765’, ’Green’, ’Music’);
  ```

- This insertion must be represented by the insertion of the tuple
  ```sql
    (’30765’, ’Green’, ’Music’, null)
  ```
  into the instructor relation

## Some Updates cannot be Translated Uniquely

- ```sql
    create view instructor_info as
        select ID, name, building
        from instructor, department
        where instructor.dept_name = department.dept_name;
  ```

- ```sql
    insert into instructor info values ('69987', 'White', 'Taylor');
  ```  
  - which department, if multiple departments in Taylor?
  - what if no department is in Taylor?

- Most SQL implementations allow updates only on simple views
  - The **from** clause has only one database relation
  - The **select** clause contains only attribute names of the relation, and does not have any expressions aggregates, or **distinct** specification
  - Any attribute not listed in the **select** clause can be set to null
  - The query does not have a **group by** or **having** clause

## And Some Not at All

- ```sql
    create view history_instructors as
        select *
        from instructor
        where dept_name = 'History';
  ```

- What happens if we insert (’25566’, ’Brown’, ’Biology’, 100000) into history_instructors?

## Materialized Views

- **Materializing a view**: create a physical table containing all the tuples in the result of the query defining the view

- If relations used in the query are updated, the materialized view result becomes out of date

  - Need to **maintain** the view, by updating the view whenever the underlying relations are updated

# Lecture 3.4: Intermediate SQL/3

## Transactions

- Unit of work
- Atomic transaction
  - either fully executed or rolled back as if it never happened
- Isolation from concurrent transactions
- Transactions begin implicitly
  - End by **commit work** or **rollback work**
- But default on most databases: each SQL statement commits automatically
  - Can turn off auto-commit for a session (for example, using API)
  - In SQL:1999, can use: **begin atomic ... end**
    - Not supported on most databases

## Integrity Constraints

- Integrity constraints guard against accidental damage to the database, by ensuring that authorized changes to the database do not result in a loss of data consistency
  - A checking account must have a balance greater than Rs. 10,000.00
  - A salary of a bank employee must be at least Rs. 250.00 an hour
  - A customer must have a (non-null) phone number

## Integrity Constraints on a Single Relation

- **not null**
- **primary key**
- **unique**
- **check**(P), where P is a predicate

## Not Null and Unique Constraints

- **not null**
  - Declare name and budget to be not null
    ```sql
    name varchar(20) not null,
    budget numeric(12, 2) not null
    ```

- **unique** $(A_1, A_2, ..., A_m)$
  - The unique specification states that the attributes $A_1, A_2, ..., A_m$ form a candidate key
  - Candidate keys are permeitted to be null (unlike primary keys)

## The check clause

- **check**(P), where P is a predicate
- Ensure that semester is one of fall, winter, spring, or summer:
  ```sql
  create table section (
    course_id varchar(8),
    sec_id varchar(8),
    semester varchar(6),
    year numeric(4, 0),
    building varchar(15),
    room_number varchar(7),
    time_slot_id varchar(4),
    primary key (course_id, sec_id, semester, year),
    check (semester in ('fall', 'winter', 'spring', 'summer'))
  );
  ```

## Referential Integrity

- Ensures that a value that appears in one relation for a given set of attributes also appears for a certain set of attributes in another relation

- Example: If “Biology” is a department name appearing in one of the tuples in the instructor relation, then there exists a tuple in the department relation for “Biology”

- Let A be a set of attributes. Let R and S be two relations that contain attributes A and where A is the primary key of S. A is said to be a **foreign key** of R if for any values of A appearing in R these values also appear in S

## Cascading Actions in Referential Integrity

- With cascading, you can define the actions that the Database Engine takes when a user tries to delete or update a key to which existing foreign keys point

- ```sql
    create table course (
        course_id char(5) primary key,
        title varchar(20),
        dept_name varchar(20) references department
    );
  ```

- ```sql
    create table course (
        ...
        dept_name varchar(20),
        foreign key (dept_name) references department
            on delete cascade
            on update cascade,
        ...
    );
  ```

- Alternative actions to cascade: **no action**, **set null**, **set default**

## Integrity Constraint Violation During Transactions

- ```sql
    create table person (
        ID char(10),
        name char(40),
        mother char(10),
        father char(10),
        primary key ID,
        foreign key father references person,
        foreign key mother references person)
  ```

- How to insert a tuple without causing constraint violation?
  - Insert father and mother of a person before inserting person
  - OR, Set father and mother to null initially, update after inserting all persons (not possible if father and mother attributes declared to be not null)
  - OR Defer constraint checking (will discuss later)

## Built-in Data Types in SQL

- **date**: Dates, containing a (4 digit) year, month and date
  - Example: **date** '2005-7-27'

- **time**: Time of day, in hours, minutes and seconds.
  - Example: **time** '09:00:30' time '09:00:30.75'

- **timestamp**: date plus time of day
  - Example: **timestamp** '2005-7-27 09:00:30.75'

- **interval**: period of time
  - Example: **interval** '1' day
  - Subtracting a date/time/timestamp value from another gives an interval value
  - Interval values can be added to date/time/timestamp values

## Index Creation

- ```sql
    create table student(ID varchar(5),
    name varchar(20) not null,
    dept_name varchar(20),
    tot cred numeric (3,0) default 0,
    primary key (ID))
  ```

- create index studentID index on student(ID)

- Indices are data structures used to speed up access to records with specified values for index attributes
  ```sql
    select *
    from student
    where ID = '12345'
  ```
  - Can be executed by using the index to find the required record, without looking at all records of student

## User Defined Types

- **create type** construct in SQL creates user-defined type (alias, like typedef in C)
  ```sql
    create type Dollars as numeric (12,2) final
  ```

- ```sql
    create table department (
        dept_name varchar (20),
        building varchar (15),
        budget Dollars
    );
  ```

## Domains

- **create domain** construct in SQL-92 creates user-defined domain types
  ```sql
    create domain person_name char(20) not null
  ```

- Types and domains are similar

- Domains can have constraints, such as **not null** specified on them
  ```sql
    create domain degree_level varchar(10)
    constraint degree_level_test
    check (value in ('Bachelors', 'Masters', 'Doctorate'));
  ```

## Large-Object Types

- Large objects (photos, videos, CAD files, etc.) are stored as a large object:
  - **blob**: binary large object – object is a large collection of uninterpreted binary data (whose interpretation is left to an application outside of the database system)
  - **clob**: character large object – object is a large collection of character data
  - When a query returns a large object, a pointer is returned rather than the large object itself

## Authorization

- Forms of authorization on parts of the database:
  - **Read** - allows reading, but not modification of data
  - **Insert** - allows insertion of new data, but not modification of existing data
  - **Update** - allows modification, but not deletion of data
  - **Delete** - allows deletion of data

- Forms of authorization to modify the database schema
  - **Index** - allows creation and deletion of indices
  - **Resources** - allows creation of new relations
  - **Alteration** - allows addition or deletion of attributes in a relation
  - **Drop** - allows deletion of relations

## Authorization Specification in SQL

- The **grant** statement is used to confer authorization
  ```sql
    grant <privilege list>
    on <relation name or view name> to <user list>
  ```

- $\text{<user list>}$ is:
  - a user-id
  - **public**, which allows all valid users the privilege granted
  - A role (more on this later)

- Granting a privilege on a view does not imply granting any privileges on the underlying relations

- The grantor of the privilege must already hold the privilege on the specified item (or be the database administrator)

## Privileges in SQL

- **select**: allows read access to relation, or the ability to query using the view
  - Example: grant users $U_1$, $U_2$, and $U_3$ **select** authorization on the instructor relation:
    ```sql
      grant select on instructor to U1, U2, U3
    ```

- **insert**: the ability to insert tuples

- **update**: the ability to update tuples

- **delete**: the ability to delete tuples

- **all privileges**: used as a short form for all the allowable privileges

## Revoking Authorization in SQL

- The **revoke** statement is used to revoke authorization
  ```sql
    revoke <privilege list>
    on <relation name or view name> from <user list>
  ```

- Example:
  ```sql
    revoke select on branch from U1, U2, U3
  ```

- $\text{<privilege-list>}$ may be *all* to revoke all privileges the revokee may hold
- If $\text{<revokee-list>}$ includes *public*, all users lose the privilege except those granted it explicitly
- If the same privilege was granted twice to the same user by different grantees, the user may retain the privilege after the revocation
- All privileges that depend on the privilege being revoked are also revoked

## Roles

- ```sql
    create role instructor;
    grant instructor to Amit;
   ```

- Privileges can be granted to roles:
  ```sql
    grant select on takes to instructor;
  ```

- Roles can be granted to users, as well as to other roles
  ```sql
    create role teaching_assistant;
    grant teaching_assistant to instructor;
  ```
  - Instructor inherits all privileges of teaching_assistant

- Chain of roles
  - **create role** dean;
  - **grant** instructor **to** dean;
  - **grant** dean **to** Satoshi;

## Authorization on Views

 ```sql
    create view geo_instructor as
    (select *
      from instructor
      where dept_name = ’Geology’);
      grant select on geo_instructor to geo_staff
 ```

- Suppose that a geo_staff member issues
 
 ```sql
    select *
    from geo_instructor;
 ```

- What if
  - geo_staff does not have permissions on instructor?
  - creator of view did not have some permissions on instructor?

## Other Authorization Features

- **references** privilege to create foreign key
  ```sql
    grant reference (dept_name) on department to Mariano;
  ```
  - why is this required?

- Transfer of privileges
  - **grant select on** department **to** Amit **with grant option**;
  - **revoke select on** department **from** Amit, Satoshi **cascade**;
  - **revoke select on** department **from** Amit, Satoshi **restrict**;

# Lecture 3.5: Advanced SQL

## Native Language ← → Query Language

![](aaa.svg)

## Functions and Procedures

- Functions / Procedures and Control Flow Statements were added in SQL:1999
  - Functions/Procedures can be written in SQL itself, or in an external programming language (like C, Java)
  - Functions written in an external languages are particularly useful with specialized data types such as images and geometric objects
    - Example: Functions to check if polygons overlap, or to compare images for similarity
  - Some database systems support table-valued functions, which can return a relation as a result
- SQL:1999 also supports a rich set of imperative constructs, including loops, if-then-else, and assignment
- Many databases have proprietary procedural extensions to SQL that differ from SQL:1999

## SQL Functions

- Define a function that, given the name of a department, returns the count of the number of instructors in that department:
 
    ```sql
        create function dept_count (dept name varchar(20))
            returns integer
            begin
            declare d_count integer;
                select count (*) into d_count
                from instructor
                where instructor.dept_name = dept_name
            return d_cont;
            end
    ```

- The function dept count can be used to find the department names and budget of all departments with more that 12 instructors:
  
    ```sql
        select dept_name, budget
        from department
        where dept_count (dept_name ) > 12
    ```

## SQL Functions (2)

- Compound statement: **begin . . . end**
  May contain multiple SQL statements between begin and end.

- **returns** – indicates the variable-type that is returned (for example, integer)

- **return** – specifies the values that are to be returned as result of invoking the function

- SQL function are in fact *parameterized views* that generalize the regular notion of views by allowing parameters

## Table Functions

- Functions that return a relation as a result added in SQL:2003

- Return all instructors in a given department:
  ```sql
    create function instructor_of (dept_name char(20))
      returns table (
        ID varchar(5),
        name varchar(20),
        dept_name varchar(20)
        salary numeric(8, 2) )
      returns table
        (select ID, name, dept_name, salary
        from instructor
        where instructor.dept_name = instructor_of.dept_name)
    ```

- Usage
  ```sql
    select *
    from table (instructor_of (‘Music’))
  ```

## SQL Procedures

- The dept count function could instead be written as procedure:
 
  ```sql
        create procedure dept_count_proc (
            in dept_name varchar (20), out d_count integer)
            begin
                select count(*) into d_count
                from instructor
                where instructor.dept_name = dept_count_proc.dept_name
            end
    ```

- Procedures can be invoked either from an SQL procedure or from embedded SQL, using the **call** statement.

    ```sql
    declare d_count integer;
    call dept_count_proc(‘Physics’, d_count);
    ```

- Procedures and functions can be invoked also from dynamic SQL

- SQL:1999 allows **overloading** - more than one function/procedure of the same name as long as the number of arguments and/or the types of the arguments differ

## Language Constructs for Procedures and Functions

- SQL supports constructs that gives it almost all the power of a general-purpose programming language.
  - Warning: **Most database systems implement their own variant of the standard syntax**

- Compound statements: **begin . . . end**
  - May contain multiple SQL statements between **begin** and **end**
  - Local variables can be declared within a compound statement

## Language Constructs (2): while and repeat

- **while** loop
  
    ```sql
        while boolean_expression do
            sequence_of_statements;
        end while;
    ```
- **repeat** loop

    ```sql
        repeat
            sequence_of_statements;
        until boolean_expression;
        end repeat;
    ```

## Language Constructs (3): for

- **for** loop
  - Permits iteration over all results of a query

- Find the budget if all departments: 
  ```sql
      declare n integer default 0;
      for r as
        select budget from department
      do
        set n = n + r.budget
      end for;
  ```

## Language Constructs (4): if-then-else

- Conditional statements
  - **if**-**then**-**else**
  - **case**

- **if**-**then**-**else** statement

    ```sql
        if boolean_expression then
            sequence_of_statements;
        elseif boolean_expression then
            sequence_of_statements;
        ...
        else
            sequence_of_statements;
        end if;
    ```

- The **if** statement supports the use of optional **elseif** clauses and a default **else** clause

- Example procedure: registers student after ensuring that classroom capacity is not exceeded
  - Returns 0 on success and -1 if capacity is exceeded

## Language Constructs (5): Simple case

- Simple **case** statement

    ```sql
        case variable
            when value1 then
                sequence_of_statements;
            when value2 then
                sequence_of_statements;
            ...
            else
                sequence_of_statements;
        end case;
    ```

- The **when** clause of the **case** statement defines the value that when satisfied determines the flow of control

## Language Constructs (6): Searched case

- Searched **case** statements

    ```sql
        case
            when sql_expression = value1 then
                sequence_of_statements;
            when sql_expression = value2 then
                sequence_of_statements;
            ...
            else
                sequence_of_statements;
        end case;
    ```

- Any supported SQL expression can be used here. These expressions can contain references to variables, parameters, special registers, and more.

## Language Constructs (7): Exception

- Signaling of exception conditions, and declaring handlers for exceptions 

    ```sql
        declare out_of_classroom_seats condition
        declare exit handler for out_of_classroom_seats
        begin
            ...
            signal out_of_classroom_seats
            ...
        end
    ```

  - The handler here is **exit** – causes enclosing **begin . . . end** to be terminate and exit
  - Other actions possible on exception

## External Language Routines*

- SQL:1999 allows the definition of functions and procedures in an external / imperative programming language, (Java, C#, C, or C++) which can be invoked from SQL queries

- Such functions can be more efficient than functions defined in SQL, and computations that cannot be carried out in SQL can be executed by these functions

- Declaring external language procedures and functions

    ```sql
        create procedure dept_count_proc(
                in dept_name varchar(20),
                out count integer)
            language C
            external name ’/usr/avi/bin/dept_count_proc’

        create function dept_count(dept_name varchar(20))
        returns integer
            language C
            external name ‘/usr/avi/bin/dept_count’
    ```

## External Language Routines (2)*

- Benefits of external language functions/procedures:
  - More efficient for many operations, and more expressive power

- Drawbacks
  - Code to implement function may need to be loaded into database system and executed in the database system’s address space
    - Risk of accidental corruption of database structures
    - Security risk, allowing users access to unauthorized data
  - There are alternatives, which give good security at the cost of performance
  - Direct execution in the database system’s space is used when efficiency is more important than security

## External Language Routines (3)*: Security

- To deal with security problems, we can do one of the following:
  - Use **sandbox** techniques
    - That is, use a safe language like Java, which cannot be used to access/damage other parts of the database code
  - Run external language functions/procedures in a separate process, with no access to the database process’ memory
    - Parameters and results communicated via inter-process communication
- Both have performance overheads
- Many database systems support both above approaches as well as direct executing in database system address space

## Trigger

- A **trigger** defines a set of actions that are performed in response to an **insert**, **update**, or **delete** operation on a specified table
  - When such an SQL operation is executed, the trigger is said to have been **activated**
  - Triggers are **optional**
  - Triggers are defined using the **create trigger** statement

- Triggers can be used
  - To enforce data integrity rules via referential constraints and check constraints
  - To cause updates to other tables, automatically generate or transform values for inserted or updated rows, or invoke functions to perform tasks such as issuing alerts

- To design a trigger mechanism, we must:
  - Specify the **events** / (like **update**, **insert**, or **delete**) for the trigger to executed
  - Specify the **time** (**BEFORE** or **AFTER**) of execution
  - Specify the **actions** to be taken when the trigger executes

- **Syntax of triggers may vary across systems**

## Types of Triggers: BEFORE

- **BEFORE triggers**
  - Run before an **update**, or **insert**
  - Values that are being updated or inserted can be modified before the database is actually modified. You can use triggers that run before an update or insert to:
    - Check or modify values before they are actually updated or inserted in the database
      - Useful if user-view and internal database format differs
    - Run other non-database operations coded in user-defined functions
  
- **BEFORE DELETE triggers**
  - Run before a **delete**
    - Checks values (a raises an error, if necessary)

## Types of Triggers (2): AFTER

- **AFTER triggers**
  - Run before an **update**, **insert**, or **delete**
  - You can use triggers that run after an update or insert to:
    - Update data in other tables
      - Useful for maintain relationships between data or keep audit trail
    - Check against other data in the table or in other tables
      - Useful to ensure data integrity when referential integrity constraints aren’t appropriate, or
      - when table check constraints limit checking to the current table only
    - Run non-database operations coded in user-defined functions
      - Useful when issuing alerts or to update information outside the database

## Row Level and Statement Level Triggers

There are two types of triggers based on the level at which the triggers are applied:

- **Row level triggers** are executed whenever a row is affected by the event on which the trigger is defined.
  - Let Employee be a table with 100 rows. Suppose an **update** statement is executed to increase the salary of each employee by 10%. Any row level **update** trigger configured on the table Employee will affect all the 100 rows in the table during this update.

- **Statement level triggers** perform a single action for all rows affected by a statement, instead of executing a separate action for each affected row.
  - Used for each **statement** instead of for each **row**
  - Uses **referencing old table** or **referencing new table** to refer to temporary tables called **transition tables** containing the affected rows
  - Can be more efficient when dealing with SQL statements that update a large number of rows

## Triggering Events and Actions in SQL

- Triggering event can be an insert, delete or update
- Triggers on update can be restricted to specific attributes
  - For example, **after update of** *grade* **on** *takes*
- Values of attributes before and after an update can be referenced
  - **referencing old row as** : for deletes and updates
  - **referencing new row as** : for inserts and updates
- Triggers can be activated before an event, which can serve as extra constraints. For example, convert blank grades to null.
  ```sql
    create trigger setnull_trigger before update of takes
    referencing new row as nrow
    for each row
    when (nrow.grade = ‘ ‘)
      begin atomic
        set nrow.grade = null;
      end;
  ```

## Triggering to Maintain credits_earned value


```sql
  create trigger credits_earned after update of grade on takes
  referencing new row as nrow
  referencing old row as orow
  for each row
  when nrow.grade <> 'F' and nrow.grade is not null and
       (orow.grade = 'F' or orow.grade is null)
    begin atomic
      update student
      set tot_cred = tot_cred + 
          (select credits
          from course
          where course.course_id = nrow.course_id)
      where student.ID = nrow.ID;
    end;
```

## How to use triggers?

- The optimal use of DML triggers is for short, simple, and easy to maintain write operations that act largely independent of an applications business logic.

- Typical and recommended uses of triggers include:
  - *Logging changes* to a history table
  - *Auditing users and their actions* against sensitive tables
  - *Adding additional values to a table* that may not be available to an application (due to security restrictions or other limitations), such as:
    - Login/user name
    - Time an operation occurs
    - Server/database name
  - Simple validation

## How not to use triggers?

- Triggers are like Lays: Once you pop, you can’t stop
- One of the greatest challenges for architects and developers is to ensure that
  - triggers are used only as needed, and
  - to not allow them to become a one-size-fits-all solution for any data needs that happen to come along
- Adding triggers is often seen as faster and easier than adding code to an application, but the cost of doing so is compounded over time with each added line of code

## How to use triggers? (2)

- Triggers can become dangerous when:
  - There are too many
  - Trigger code becomes complex
  - Triggers go cross-server - across databases over network
  - Triggers call triggers
  - Recursive triggers are set to ON. This database-level setting is set to off by default
  - Functions, stored procedures, or views are in triggers
  - Iteration occurs